var store = [{
        "title": "Homebrew - менеджер пакетов",
        "excerpt":"brew  ","categories": [],
        "tags": [],
        "url": "/notes/brew/",
        "teaser": null
      },{
        "title": "Настраиваем новый mac",
        "excerpt":"Многие сталкиваются с тем что им достается запечатанная коробка с новым маком который хочется быстрее применить к работе. Конечно, можно воспользоваться TimeMachine и перенести данные, либо накатить все с нуля. Пост будет обновляться со временем как будут изменяться инструкции или добавляться новые инструменты. Каждый из нас сталиквается с тем что...","categories": [],
        "tags": ["tag1","tag2"],
        "url": "/notes/newmac/",
        "teaser": null
      },{
        "title": "Obsidian",
        "excerpt":"Плагины   Хитрости   Как переносить строки в блоках кода  ","categories": [],
        "tags": ["tag1","tag2"],
        "url": "/notes/obsidian/",
        "teaser": null
      },{
        "title": "Другие приложеньки",
        "excerpt":"Умные таблицы   Notion   Редакторы диаграмм   Текстовые редакторы   Менеджеры файлов   Forklift   На текущий момент это лучший менеджер файлов с поддержкой безумного количества протоколов. Моя любимая функция - синхронизация измененных файлов в разных локациях, например, с SFTP площадки на диск S3 на DigitalOcean.   #   ","categories": [],
        "tags": [],
        "url": "/notes/otherapps/",
        "teaser": null
      },{
        "title": "Меня очень расстроил",
        "excerpt":"Несколько разочаровал последний сезон «Декстера». Хотя почему только последний? За исключением первых двух и сезона про Троицу все остальные казались какими-то скомканными, торопящимися и лишенными важной психологической составляющей. Неуловимый, холоднокровный, скрытный Декстер к концу становится чуть ли не массовым убийцей, а потом и просто ОБЫЧНЫМ человеком. Как могло случится что...","categories": [],
        "tags": ["movie","мнение"],
        "url": "/posts/dexter",
        "teaser": null
      },{
        "title": "Визуализация гравитации",
        "excerpt":"Лучшее что могут показать    \t   ","categories": [],
        "tags": ["video"],
        "url": "/posts/gravity",
        "teaser": null
      },{
        "title": "Mapsicon",
        "excerpt":"Mapsicon это бесплатная коллекция карт с почти каждой страной земли. Доступны в 11 размерах  формата PNG до 1024×1024ю Формат .svg присутствует                                                                                   https://github.com/djaiss/mapsicon                                                                  ","categories": [],
        "tags": ["tools"],
        "url": "/posts/mapsicon",
        "teaser": null
      },{
        "title": "Хинт про работу с ключами SSH на mac os x",
        "excerpt":"Что такое SSH и для чего они нужны лучше чем уже сказано на Хабре рассказать не смогу. Потому лишь добавлю что внезапно а в версии 10.12.2 macOS обновилась библиотека OpenSSH 1 и логика работы с ключами. Что конечно же все сломало — ssh-ключи не загружаются после загрузки системы. Что очень...","categories": [],
        "tags": ["macos","manual","ssh"],
        "url": "/posts/macos-ssh-keys-and-keychain",
        "teaser": null
      },{
        "title": "Копируем заголовок и адрес WEB-страницы в формате Markdown",
        "excerpt":"Простейший скрипт для копирования заголовка и URL’а страницы в Safari в формате Markdown:        400: Invalid request   У меня скрипт висит в Alfred на сочетание клавиш ⌥+C.      ","categories": [],
        "tags": ["macOS","productivity"],
        "url": "/posts/copy-titie-and-url-as-markdown",
        "teaser": null
      },{
        "title": "Немного о прототипах",
        "excerpt":"На прошлой неделе пришлось плотно повозиться с одним прототипом приложения, чего, надо признаться я не делал достаточно долго. Отличный повод посмотреть что есть из инструментов на рынке! — подумал я, и по очереди установил несколько. Конечно в сети полно статей типа «5/10/13 лучших инструментов прототипирования для дизайнера/менеджера/садовника в этом году»,...","categories": ["О прототипах"],
        "tags": ["framer","origami","опыт","прототипы"],
        "url": "/posts/o-prototipakh",
        "teaser": null
      },{
        "title": "iOS 11 kit для Framer",
        "excerpt":"Неленивый человек Brent Caswell подготовил визуальный фреймворк со стилями основных элементов iOS 11.     Для нормальной работы нужно скачать сами файлы с сайта автора или Github и установить шрифт San Francisco   Стили      Colors.framer   Fonts.framer      Элементы      System.framer   Bars.framer   Controls.framer   Views.framer   Keyboards.framer     ","categories": [],
        "tags": ["framer"],
        "url": "/posts/ios-11-kit-for-framer",
        "teaser": null
      },{
        "title": "iTunes и внешняя колонка (AirPlay/BlueTooth)",
        "excerpt":"Часто при работе дома, транслирую музыку из iTunes на внешнюю колонку Bowers &amp; Wilkins Z2. В свое время я специально искал устройство с поддержкой AirPlay. Самое большое неудобство — невозможность регулировать звук на внешнем устройстве через медиа-клавиши Macbook, так как они отвечают исключительно за системный звук Mac, а значит что...","categories": ["lifehack"],
        "tags": ["airplay","alfred","apple","itunes","soft"],
        "url": "/posts/itunes-airplay-and-airplay",
        "teaser": null
      },{
        "title": "Yet another GIT help site",
        "excerpt":"http://ohshitgit.com      via  ","categories": ["Tools"],
        "tags": [],
        "url": "/posts/yet-another-git-help-site",
        "teaser": null
      },{
        "title": "Медиа-клавиши в iTunes.",
        "excerpt":"“It’s not a bug; it’s a feature. (c)” У Apple есть потрясающая способность принимать решения в дизайне продуктов вопреки здравому смыслу и логике. iTunes это вероятно один из самых невидимых миром монстров который по идее должен делать только одну работу, но при этом оброс кучей других возможностей, при этом несколько...","categories": [],
        "tags": ["apple","itunes"],
        "url": "/posts/itunes-and-media-buttons",
        "teaser": null
      },{
        "title": "Как эффективно использовать массивы во Framer",
        "excerpt":"К сожалению, только на английском языке, но чуть позже вынесу сюда самые полезные приемы которые помогут в разработке прототипа. как добавить слои из Sketch в массив как правильно применить одно и тоже событие к нескольким одинаковым объектам Полезные ссылки Code Less &amp; Achieve More with Arrays in Framer – Framer...","categories": [],
        "tags": ["framer"],
        "url": "/posts/arrays-in-framer",
        "teaser": null
      },{
        "title": "Как временно отключить заставку и сон вашего Macbook",
        "excerpt":"Представим, у вас важная презентация и нужно запретить mac’у отключать дисплей, или вы смотрите новую серию Игры престолов и не хочется все время дергать курсор, дабы дисплей не погас. Или выполняется важный расчет который остановиться если Macbook заснет. Может помочь маленькое бесплатное приложение Caffeine или можно воспользоваться стандартной командой caffeinate...","categories": [],
        "tags": ["macos","terminal"],
        "url": "/posts/terminal-energy-and-display",
        "teaser": null
      },{
        "title": "Как отобразить скрытые файлы в Finder",
        "excerpt":"Внезапное открытие после 8 лет использования Macbook – ⌘+⇧+. отображает скрытые файлы в Finder.     ","categories": [],
        "tags": ["macos"],
        "url": "/posts/hidden-files-finder",
        "teaser": null
      },{
        "title": "Как работать с мета-данными в appstore connect",
        "excerpt":"В отличии от Google Play Console, Appstore Connect крайне недружелюбен к менеджеру которому нужно подготовить материалы на нескольких языках для публикации новых версий приложения. Поэтому спасением при большом количестве приложение и частых релизах может выступить Fastlane Deliver. Инструмент позволит автоматизировать: Загрузку, буквально, сотен скриншотов для разных языков и платформ. Обновление...","categories": [],
        "tags": ["apple","appstore","автоматизация"],
        "url": "/posts/udobnyj-sposob-raboty-s-meta-v-app-store",
        "teaser": null
      },{
        "title": "Дизайн привычных вещей. Дональд Норман",
        "excerpt":"С одной стороны, книгу нужно бы прочитать каждому дизайнеру интерфейсов и промышленному дизайнеру, что бы понять какую боль могут приносить их разработки будущим пользователям. С другой стороны — ни за что не порекомендую покупать именно это издание. Во-первых, примеры безнадёжно устарели, лично я сдался когда в очередной раз прочитал: Эксплуатация...","categories": [],
        "tags": ["review","books"],
        "url": "/posts/design-privichnih-vechey",
        "teaser": null
      },{
        "title": "Интернет термины",
        "excerpt":"Часто бывает необходимо подобрать правильно определение для договора или элементарного соглашения, а иногда найти простые слова чтобы объяснить клиенту/партнеру о чем идет речь… AR, Дополненная реальность (англ. augmented reality, AR) Интеграция виртуальных объектов в реальную среду, воспроизводимую на электронных устройствах, предназначенных для визуального отображения информации(мониторах, экранах, дисплеях). Augmented reality (AR)...","categories": [],
        "tags": [],
        "url": "/internet-definitions/",
        "teaser": null
      },{
        "title": "Лицензии при разработке программных продуктов софта",
        "excerpt":"В разработке ПО часто является разумным использовать уже готовые фреймворки и библиотеки для решения тех или иных задач. Важно помнить, что несмотря на статус open source, использование чужого кода несет права и обязанности. Вы часто можете взять чужие исходники, использовать их но вы обязаны соблюдать требования которые они возлагают на...","categories": [],
        "tags": ["playbook"],
        "url": "/posts/playbook-licenses",
        "teaser": null
      },{
        "title": "Уведомления Jenkins в Telegram",
        "excerpt":"Одно из правил работы с CI — все должны видеть статус сборок, тоесть синхронизация. А что может быть лучше чем уведомление о неудачном, или напротив удачном, билде в чате. 3cky/jenkins-telegram-uploader-plugin: Jenkins CI post-build action that uploads artifacts generated during build process to Telegram chats. jenkinsci/telegram-notifications-plugin: This plugin allows you to...","categories": [],
        "tags": ["Jenkins","manual"],
        "url": "/posts/telegram-notifications-jenkins",
        "teaser": null
      },{
        "title": "Что такое хорошая [продуктовая] задача.",
        "excerpt":"Небольшое лирическое вступление. Когда-то я играл в баскетбол и тренер беспрестанно вбивал нам в голову — “если твой пас не приняли в этом твоя вина”, или если коротко — “Виноват отдающий”. Как ни странно, спустя годы я часто вспоминаю это утверждение в работе с разработчиками, коллегами или топ-менеджментом. Были у...","categories": ["work"],
        "tags": ["playbook"],
        "url": "/posts/good-task",
        "teaser": null
      },{
        "title": "Подход к работе в basecamp (37signals)",
        "excerpt":"Довольно старый но очень познавательный пост в блоге SVN, как они сами написали отвечающий на вопросы: Как вы парни на самом деле работаете? Как выбираете какими вещами заниматься? Какие у вас команды по размеру? Как вы структурировали вашу работу? То есть в принципе те вопросы которые всегда интересовали их “последователей”....","categories": ["work"],
        "tags": ["howto","management"],
        "url": "/posts/how-basecamp-work",
        "teaser": null
      },{
        "title": "Мысли про работу",
        "excerpt":"Несколько цитат которые подзацепили когда писал статью про работу basecamp. But crisis mode is reserved for true crisis. What we have found to be true is Parkinson’s Law: “Work expands to fill the time available.” Give something 3 months and it’ll take 3 months. Give something 6 weeks and you’ll...","categories": ["work"],
        "tags": ["цитаты","принципы"],
        "url": "/posts/citaty",
        "teaser": null
      },{
        "title": "BIG.RU — маркет для дома",
        "excerpt":" ","categories": [],
        "tags": [],
        "url": "/projects/bigru/",
        "teaser": "/assets/images/uploads/2022/bigru_teaser1.png"
      },{
        "title": "CDEK.Market",
        "excerpt":" ","categories": [],
        "tags": [],
        "url": "/projects/cdekmarket/",
        "teaser": "/assets/images/uploads/2022/cdek1.png"
      },{
        "title": "GetTransfer App",
        "excerpt":"GetTransfer.com - сервис бронированию трансферов и аренды автомобилей с водителем. Приложения позволяют заказать трансфер в любом регионе мира даже если клиент находится в другом, для этого активно используются картографические сервисы Google Maps (прямой и обратный геокодинг). В ответ на заказ клиент получает список индивидуальных предложений от локальных перевозчиков. Пассажир может...","categories": [],
        "tags": [],
        "url": "/projects/gettransfer/",
        "teaser": "/assets/images/gtr_icon.png"
      },{
        "title": "GetRentaCar App",
        "excerpt":"Здесь путешественники арендуют машины у местных владельцев. Арендаторы найдут лучшие авто в выбранном регионе, а владельцы получат дополнительный заработок. Экспериментальное приложение для Apple iOS ориентированное как на арендаторов так и арендодателей автотранспорта и мотоциклов. Примеры интерфейсов С помощью геопозиционирования легко можно найти подходящие предложения. Мультиязычность позволит воспользоваться приложением клиенту практически...","categories": [],
        "tags": [],
        "url": "/projects/getrentacarapp/",
        "teaser": "/assets/images/projects/grac/grac_teaser.png"
      },{
        "title": "GetTransport Apps",
        "excerpt":"Приложение для заказчиков и перевозчиков маркетплейса грузовых перевозок. Как это работает Клиент формирует заявку на грузоперевозку, указывает необходимые услуги и маршрут. Клиент Грузоперевозчики получают заявки и предлогают свои цены на услуги. Универсальное мобильное приложение для ​iOS​ и Android позволяет клиентам и исполнителям выполнять свои задачи: Заказчикам: оставить заявку на грузоперевозку...","categories": [],
        "tags": [],
        "url": "/projects/gettransport/",
        "teaser": "https://is2-ssl.mzstatic.com/image/thumb/Purple113/v4/0d/f1/0d/0df10dd9-e011-0851-439c-5a5f6f119668/AppIcon-0-0-1x_U007emarketing-0-0-0-10-0-0-sRGB-0-0-0-GLES2_U002c0-512MB-85-220-0-0.png/230x0w.png"
      },{
        "title": "GetTransfer Driver",
        "excerpt":"Профессиональное приложение для перевозчиков и для организации работы автопарков и обеспечения выполнения заказов на трансферы, управление водителями и расписанием.     ","categories": [],
        "tags": [],
        "url": "/projects/gtrdriver/",
        "teaser": "/assets/images/projects/gtrdriver/driver_teaser.png"
      },{
        "title": "Мессенджеры",
        "excerpt":"ICQ и Agent Mail.Ru для iOS и Mac OS X   Instant messaging – Mail.ru Group                                                                                                                                Агент и ICQ для Mac                   ","categories": [],
        "tags": [],
        "url": "/projects/messengers/",
        "teaser": "/assets/images/icq.png"
      },{
        "title": "Риф-киб",
        "excerpt":"Приложение для мероприятия   Redmadrobot on Twitter: “#rif #rif2012 Мобильное приложение РИФ+КИБ 2012 позволяет добавлять лекции из расписания прямо в ваш календарь, удобно: http://t.co/qShSVcoi” / Twitter  ","categories": [],
        "tags": [],
        "url": "/projects/rif/",
        "teaser": "/assets/images/rif_kib_03_thumb.png"
      },{
        "title": "Geometria.Ru App",
        "excerpt":"Приложение для посетителей сайта о ночной жизни №1 Geometria это сайт №1 о ночных и культурных событиях России. Найди себя на фотографии с вечеринки, отмечай себя и своих друзей. Приложение Geometria.Ru — одно из первых которое мы разработали с учетом нового, на тот момент, подхода к дизайну и оформления приложений...","categories": [],
        "tags": [],
        "url": "/projects/geometria/",
        "teaser": "/assets/images/geometria_icon.png"
      },{
        "title": "Мишлен бизнес-бонус",
        "excerpt":"Мишлен Бонус это программа лояльности для постоянных покупателей грузовых шин Мишлен. В поддержку проведения программы был разработан WEB-сайт с личными кабинетами дилеров и покупателей где можно ввести уникальный код и выбрать призы для обмена на начисленные бонусные баллы. Для прямой связи с пользователя предназначен модуль email-маркетинга: рассылка html-писем, сбор статистики...","categories": [],
        "tags": [],
        "url": "/projects/michelin-bonus/",
        "teaser": "/assets/images/michelin.jpg"
      },{
        "title": "Futubra Android App",
        "excerpt":"Платформа для микроблогинга Futubra.Ru выделялась своими богатыми мультимедийными возможностями. Посетители делились свои фотографиями, видео, мыслями и любимыми цитатами.   { include image.html }  ","categories": [],
        "tags": [],
        "url": "/projects/futubra/",
        "teaser": "/assets/images/futubra.png"
      },{
        "title": "Приложения Samsung Galaxy",
        "excerpt":"В 2011 году совместно с партнером “Cheil Russia”, мы с командой RedMadRobot запустили несколько брендированных приложений приложений в поддержку маркетинга нового бренда Samsung Galaxy. Все приложения имели локальное распространение, обычно в рамках предустановленных образцов на устройствах. Особенность проекта — нативные приложения на JAVA, планшетная верстка, сжатые сроки и установка приложений...","categories": [],
        "tags": [],
        "url": "/projects/galaxy/",
        "teaser": "/assets/images/samsung_gtab_cinema_05.jpeg"
      },{
        "title": "Idea",
        "excerpt":"Мобильный виджет - это мини-программа по технологии j2me, предоставляющая онлайн доступ к информационному или развлекательному сервису в простом, удобном графическом виде на feature-фонах  ","categories": [],
        "tags": [],
        "url": "/projects/idea/",
        "teaser": "/assets/images/idea.jpg"
      },{
        "title": "Введение",
        "excerpt":"Я заметил занятную вещь, каждый год приходят новые люди в индустрию и спрашивают одни и те же вопросы, им отвечают люди которые пришли в индустрию на пару лет раньше, не всегда верно а иногда (в лучшем случае) цитируют классиков. Эта статья возникла потому как за последние 2-3 месяца я стал...","categories": [],
        "tags": ["tag1","tag2"],
        "url": "/twenty-four/product-intro/",
        "teaser": null
      },{
        "title": "Что продуктовые люди на самом деле делают",
        "excerpt":"Так что же делают эти любди целый день? в чем их задача? Важно понимать что: каждая компания понимает представление о проудктовом в IT и компаниях других есть различные роли продуктовых специалистов — менеджер, owner, CPO есть разница на каком уровне находится компания и продукт какое место занимает на рынке и...","categories": [],
        "tags": ["tag1","tag2"],
        "url": "/twenty-four/what-product-people-do/",
        "teaser": null
      },{
        "title": "Статьи для знакомства",
        "excerpt":" ","categories": [],
        "tags": ["tag1","tag2"],
        "url": "/twenty-four/links/",
        "teaser": null
      },{
        "title": "Книги",
        "excerpt":"Продуктовый менеджмент 1 книга 12 правил жизни. Противоядие от хаоса Джордан Питерсон Достаточно сложная книга с простым компасом для жизни Статус: 📗 читаю Социальная психология Проектный менеджмент 5 books Agile Product Management with Scrum: Creating Products that Customers Love Roman Pichler Толковый рассказ о роли владельца продукта в гибкой команде...","categories": [],
        "tags": ["tag1","tag2"],
        "url": "/twenty-four/product-books/",
        "teaser": null
      }]
